Revit 2027 API
BuiltInFailures.ImportFailures.ImportScaleTooLarge Property
 This scale factor would make the imported object too large. Reverting to the previous scale factor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ImportScaleTooLarge { get; }
Public Shared ReadOnly Property ImportScaleTooLarge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ImportScaleTooLarge {
	FailureDefinitionId^ get ();
}
static member ImportScaleTooLarge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace